function random_int(m, n)
{
    return Math.ceil(Math.random()*(n-m)+m);
}

function get_text()
{
    var text_array = new Array();
    text_array[0] = "没有什么能够阻挡 你对自由的向往，天马行空的生涯 你的心了无牵挂";
    text_array[1] = "强健其体魄，纯净其心灵";
    text_array[2] = "大海的宽广在于汇集大大小小的川流，生命的汪洋在于包容深深浅浅的缘分";
    text_array[3] = "爱那么短，遗忘那么长…… ";
    text_array[4] = "诚者，天之道也；思诚者，人之道也";
    text_array[5] = "天行健，君子以自强不息。";
    text_array[6] = "胜人者有力，自胜者强。――《老子》第三十三章";
    text_array[7] = "天将降大任于斯人也，必先苦其心志，劳其筋骨，饿其体肤，空乏其身，行拂乱其所为。――《孟子·告子下》";
    text_array[8] = "生于忧患而死于安乐。――《孟子·告子下》";
    text_array[9] = "人必自侮，然后人侮之。――《孟子·离娄上》";
    text_array[10] = "知耻近乎勇。――《礼记·中庸》";
    text_array[11] = "学而不思则罔，思而不学则殆。――《论语·为政》";
    text_array[12] = "学而时习之，不亦说乎？――《论语·学而》";
    text_array[13] = "知人者智，自知者明。――《老子》的33章";
    text_array[14] = "祸兮福之所倚，福兮祸之所伏。――《老子》第58章";
    text_array[15] = "合抱之木，生于毫末；九层之台，起于累土；千里之行，始于足下。――《老子》";
    text_array[16] = "穷则变，变则通，通则久。――《周易·系辞下》";
    text_array[17] = "知之为知之，不知为不知，是知也。――《论语·为政》";
    text_array[18] = "书山有路勤为径，学海无涯苦作舟";
    text_array[19] = "有志不在年高，无志空长百岁。——石成金《传家宝·俗谚牧民》";
    text_array[20] = "穷则独善其身，达则兼善天下。——《孟子·尽心上》";
    text_array[21] = "君子之交淡若水，小人之交甘若醴（li）。君子淡以亲，小人甘以绝。——《庄子·山木》";
    text_array[22] = "古之立大事者，不惟有超世之才，亦必有坚忍不拔之志。—苏轼《晁错论》";
    text_array[23] = "二人同心，其利断金。——《周易·系辞上》";
    text_array[24] = "出淤泥而不染，濯清涟而不妖。——周敦颐《爱莲说》";
    text_array[25] = "菩提本无树，明镜亦非台，本来无一物，何处惹尘埃";
    text_array[26] = "一花一世界，一佛一如来";
    text_array[27] = "上善若水。水善利万物而不争，处众人之所恶，故几于道";
    text_array[28] = "天下皆知美之为美，斯恶已。皆知善之为善，斯不善已";
    text_array[29] = "不尚贤，使民不争；不贵难得之货，使民不为盗；不见可欲，使民心不乱。<br>是以圣人之治，虚其心，实其腹，弱其志，强其骨。<br>常使民无知无欲。使夫智者不敢为也。为无为，则无不治";
    text_array[30] = "为学日益，为道日损。损之又损，以至于无为";
    text_array[31] = "谷神不死，是谓玄牝。玄牝之门，是谓天地根。绵绵若存，用之不勤";
    text_array[32] = "天下莫柔弱于水，而攻坚强者莫之能胜，以其无以易之";
    text_array[33] = "甘其食，美其服，安其居，乐其俗。邻国相望，鸡犬之声相闻，民至老死，不相往来";
    text_array[34] = "太上，不知有之；其次，亲而誉之；其次，畏之；其次，侮之。";
    text_array[35] = "大道废，有仁义；智慧出，有大伪；六亲不和，有孝慈；国家昏乱，有忠臣";
    text_array[36] = "绝圣弃智，民利百倍；绝仁弃义，民复孝慈；绝巧弃利，盗贼无有。<br>此三者以为文，不足。故令有所属：见素抱朴，少思寡欲，绝学无忧";
    text_array[37] = "天下有道，却走马以粪。天下无道，戎马生于郊";
    text_array[38] = "大悲无泪，大悟无言，大笑无声";
    text_array[39] = "人生在世如身处荆棘之中，心不动，人不妄动，不动则不伤";
    text_array[40] = "苦海无边，回头是岸。放下屠刀，立地成佛";
    text_array[41] = "前生500次的回眸才换得今生的一次擦肩而过";
    text_array[42] = "能常省察，则一句亦有余，不能省察，纵将一大藏经用完也无用处";
    text_array[43] = "恰恰用心时，恰恰无心用，无心恰恰用，常用恰恰无";
    text_array[44] = "十方如来，同一道故，出离生死，皆以直故";
    text_array[45] = "修行就是修正自己错误的观念。修行是点滴的工夫";
    text_array[46] = "你永远要感谢给你逆境的众生";
    text_array[47] = "身是菩提樹，心如明鏡台，時時勤拂拭，莫使惹塵埃";
    text_array[48] = "一念靜心，花開遍世界，每临绝境，峰回路又转";
    text_array[49] = "生活总是让我们遍体鳞伤，但到后来，那些受伤的地方一定会变成我们最强壮的地方。";
    text_array[50] = "你若盛開，清風自來，桃李不言，下自成蹊";
    text_array[51] = "物有本末，事有终始，知其先后，则近道矣。";
    text_array[52] = "女子七歲，腎氣盛，齒更髮長；二七而天癸至，任脈通，太衝脈盛，月事以時下，故有子；<br>三七，腎氣平均，故真牙生而長極；四七，筋骨堅，髮長極，身體盛壯；<br>五七，陽明脈衰，面始焦，髮始墮；六七，三陽脈衰於上，面皆焦，髮始白；<br>七七，任脈虛，太衝脈衰少，天癸竭，地道不通，故形壞而無子也。";
    text_array[53] = "丈夫八歲，腎氣實，髮長齒更；二八，腎氣盛，天癸至，精氣溢瀉，陰陽和，故能有子；<br>三八，腎氣平均，筋骨勁強，故真牙生而長極；四八，筋骨隆盛，肌肉滿壯；<br>五八，腎氣衰，髮墮齒槁；六八，陽氣衰竭於上，面焦，髮鬢頒白；<br>七八，肝氣衰，筋不能動；八八，天癸竭，精少，腎藏衰，形體皆極，則齒髮去。";
    text_array[54] = "天雨雖大 不潤無根之草 佛法雖廣 難渡無緣之人";

    var x = random_int(1,55);
    return text_array[x-1];
}
